#+TITLE: Trying Stuff

*NOTE* This file is best viewed in Emacs.

Open this file in Emacs and try stuff as you go through it.

You may want to also have the =try-configs.org= file open and run configs from there.

** Level 1 : Use the =:dir= header argument workdir of block

#+begin_src shell :results output :dir /tmp
ls
#+end_src

#+RESULTS:
: com.apple.launchd.1vx3i9e6B1
: com.apple.launchd.v5lA2IhPZW
: com.docker.docker.Sparkle.pid
: com.google.Keystone
: powerlog
: tmux-502

** Level 2 : User the =:var= header argument to inject values

#+begin_src shell :results output :dir /tmp :var greeting="Hello"
echo "$greeting World!"
#+end_src

#+RESULTS:
: Hello World!

